# Data Cleaning 

#### 1. Import pandas library.

In [16]:
import pandas as pd

#### 2. Import the users table.

In [17]:
users=pd.read_csv("../data/users.csv")

In [18]:
users.head()

   Unnamed: 0  userId  Reputation  Views  UpVotes  DownVotes
0           0      -1           1      0     5007       1920
1           1       2         101     25        3          0
2           2       3         101     22       19          0
3           3       4         101     11        0          0
4           4       5        6792   1145      662          5

#### 3. Rename Id column to userId.

renamed

#### 4. Import the posts table.

In [19]:
posts=pd.read_csv("../data/posts.csv")

In [20]:
posts.head()

   Unnamed: 0  PostId  userId  Score  ViewCount  CommentCount
0           0       1     8.0     23     1278.0             1
1           1       2    24.0     22     8198.0             1
2           2       3    18.0     54     3613.0             4
3           3       4    23.0     13     5224.0             2
4           4       5    23.0     81        NaN             3

#### 5. Rename Id column to postId and OwnerUserId to userId.

renamed

#### 6. Define new dataframes for users and posts with the following selected columns:
**users_sliced columns**: userId, Reputation, Views, UpVotes, DownVotes  
**posts_sliced columns**: postId, Score, userId, ViewCount, CommentCount

In [21]:
users.drop(["Unnamed: 0"], axis=1, inplace=True)

In [22]:
users.head()

   userId  Reputation  Views  UpVotes  DownVotes
0      -1           1      0     5007       1920
1       2         101     25        3          0
2       3         101     22       19          0
3       4         101     11        0          0
4       5        6792   1145      662          5

In [23]:
len(users.index)

40325

In [24]:
posts.drop(["Unnamed: 0"], axis=1, inplace=True)

In [25]:
posts.head()

   PostId  userId  Score  ViewCount  CommentCount
0       1     8.0     23     1278.0             1
1       2    24.0     22     8198.0             1
2       3    18.0     54     3613.0             4
3       4    23.0     13     5224.0             2
4       5    23.0     81        NaN             3

In [26]:
len(posts.index)

91976

#### 7. Merge the two dataframes created in the step above (8), users_sliced and posts_sliced. 
You will need to make a [merge](https://pandas.pydata.org/pandas-docs/stable/generated/pandas.DataFrame.merge.html) of posts and users dataframes.

In [32]:
posts.merge(users, right_index=True, left_index=True)

,PostId,userId_x,Score,ViewCount,CommentCount,userId_y,Reputation,Views,UpVotes,DownVotes
0,1,8.0,23,1278.0,1,-1,1,0,5007,1920
1,2,24.0,22,8198.0,1,2,101,25,3,0
2,3,18.0,54,3613.0,4,3,101,22,19,0
3,4,23.0,13,5224.0,2,4,101,11,0,0
4,5,23.0,81,NaN,3,5,6792,1145,662,5
...,...,...,...,...,...,...,...,...,...,...
40320,48724,10669.0,1,81.0,0,55743,1,0,0,0
40321,48725,1270.0,6,NaN,0,55744,6,1,0,0
40322,48726,16383.0,2,115.0,0,55745,101,0,0,0
40323,48727,2407.0,0,50.0,1,55746,106,1,0,0
40324,48728,2407.0,1,NaN,3,55747,1,0,0,0

#### 8. How many missing values do you have in your merged dataframe? On which columns?

In [33]:
posts.head()

   PostId  userId  Score  ViewCount  CommentCount
0       1     8.0     23     1278.0             1
1       2    24.0     22     8198.0             1
2       3    18.0     54     3613.0             4
3       4    23.0     13     5224.0             2
4       5    23.0     81        NaN             3

In [34]:
posts["ViewCount"].value_counts()

31.0      300
38.0      297
27.0      281
37.0      280
24.0      276
         ...
2822.0      1
6383.0      1
2740.0      1
5089.0      1
3054.0      1
Name: ViewCount, Length: 3714, dtype: int64

#### 9. You will need to make something with missing values.  Will you clean or filling them? Explain. 
**Remember** to check the results of your code before going to the next step.

In [40]:
posts[(posts["ViewCount"]!="NaN")]

       PostId   userId  Score  ViewCount  CommentCount
0           1      8.0     23     1278.0             1
1           2     24.0     22     8198.0             1
2           3     18.0     54     3613.0             4
3           4     23.0     13     5224.0             2
4           5     23.0     81        NaN             3
...       ...      ...    ...        ...           ...
91971  115374    805.0      2        NaN             2
91972  115375  49365.0      0        9.0             0
91973  115376  55746.0      1        5.0             2
91974  115377    805.0      0        NaN             0
91975  115378   7250.0      0        NaN             0

[91976 rows x 5 columns]

#### 10. Adjust the data types in order to avoid future issues. Which ones should be changed?

In [39]:
pd.to_numeric(posts["ViewCount"])

0        1278.0
1        8198.0
2        3613.0
3        5224.0
4           NaN
          ...
91971       NaN
91972       9.0
91973       5.0
91974       NaN
91975       NaN
Name: ViewCount, Length: 91976, dtype: float64